package test.prac05;
/*
 * 项目一；家庭记账簿
 * •模拟实现基于文本界面的《家庭记账软件》。
 * •该软件能够记录家庭的收入、支出，并能够打印收支明细表。
 * •项目采用分级菜单方式。
 * 主菜单如下：
 * -----------------家庭收支记账软件-----------------
 * 1收支明细
 * 2登记收入
 * 3登记支出
 * 4退出
 * 请选择(1-4)：_
 *  
 *假设家庭起始的生活基本金为10000元。
 *•每次登记收入（菜单2）后，收入的金额应累加到基本金上，并记录本次收入明细，以便后续的查询。
 *•每次登记支出（菜单3）后，支出的金额应从基本金中扣除，并记录本次支出明细，以便后续的查询。
 *•查询收支明细（菜单1）时，将显示所有的收入、支出名细列表 
 *
 * 
 * 
 * “登记收入”的界面及操作过程如下所示：
 * -----------------家庭收支记账软件-----------------
 * 1 收支明细
 * 2 登记收入
 * 3 登记支出
 * 4 退出
 * 请选择(1-4)：2
 * 本次收入金额：1000
 * 本次收入说明：劳务费_
 * 
 * 
 * 
 * “登记支出”的界面及操作过程如下所示：
 * -----------------家庭收支记账软件-----------------
 * 1 收支明细
 * 2 登记收入
 * 3 登记支出
 * 4 退出请选择(1-4)：3
 * 本次支出金额：800
 * 本次支出说明：物业费_
 * 
 * 
 */
public class account {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
